server/app/controllers/countries_controller.rb

  def index
     render json: Country.all
---
SELECT "countries".* FROM "countries"