server/app/controllers/users_controller.rb

SELECT users.*, countries.name AS country_name FROM "users" INNER JOIN "countries" ON "countries"."id" = "users"."country_id"
---
  def index
     render json: User.joins(:country).select('users.*', 'countries.name AS country_name')

SELECT  users.*, countries.name AS country_name FROM "users" INNER JOIN "countries" ON "countries"."id" = "users"."country_id" WHERE "users"."id" = $1 LIMIT 1  [["id", 1304]]
---
  def show
      render json: User.joins(:country).select('users.*', 'countries.name AS country_name').find(params[:id])

INSERT INTO "users" ("fullname", "phone", "country_id") VALUES ($1, $2, $3) RETURNING "id"  [["fullname", "AAAAAAAAAAA"], ["phone", "AAAAAAAA"], ["country_id", 182]]
---
  def create
    User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1389]]
UPDATE "users" SET "fullname" = $1, "phone" = $2, "country_id" = $3 WHERE "users"."id" = $4  [["fullname", "Artem"], ["phone", "7654321"], ["country_id", 181], ["id", 1405]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1412]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1412]]
---
  def destroy
    user = User.find(params[:id])
    user.destroy()